In [1]:
%matplotlib inline

In [2]:
# Import dependencies.
import matplotlib.pyplot as plt
import statistics as stat
import numpy as np
import pandas as pd

In [3]:
city_data_location = "PyBer_Analysis/Resources/city_data.csv"
ride_data_location = "PyBer_Analysis/Resources/ride_data.csv"

city_data_df = pd.read_csv(city_data_location)
ride_data_df = pd.read_csv(ride_data_location)

In [4]:
city_data_df

                city  driver_count   type
0        Richardfort            38  Urban
1       Williamsstad            59  Urban
2        Port Angela            67  Urban
3         Rodneyfort            34  Urban
4        West Robert            39  Urban
..               ...           ...    ...
115     Bradshawfurt             7  Rural
116     New Ryantown             2  Rural
117   Randallchester             9  Rural
118      Jessicaport             1  Rural
119  South Saramouth             7  Rural

[120 rows x 3 columns]

In [5]:
ride_data_df

                    city                 date   fare        ride_id
0     Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1     South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2     Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3             Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4             South Jack  2019-03-06 04:28:35  34.58  3908451377344
...                  ...                  ...    ...            ...
2370         Michaelberg  2019-04-29 17:04:39  13.38  8550365057598
2371     Lake Latoyabury  2019-01-30 00:05:47  20.76  9018727594352
2372         North Jaime  2019-02-10 21:03:50  11.11  2781339863778
2373        West Heather  2019-05-07 19:22:15  44.94  4256853490277
2374          Newtonview  2019-04-25 10:20:13  55.84  9990581345298

[2375 rows x 4 columns]

In [6]:
grouped_df = city_data_df.set_index(['city'])
grouped_df['Number of rides'] = ride_data_df.groupby(['city']).count()['ride_id']
grouped_df.index.name = None
grouped_df

                 driver_count   type  Number of rides
Richardfort                38  Urban               28
Williamsstad               59  Urban               23
Port Angela                67  Urban               19
Rodneyfort                 34  Urban               23
West Robert                39  Urban               31
...                       ...    ...              ...
Bradshawfurt                7  Rural               10
New Ryantown                2  Rural                6
Randallchester              9  Rural                5
Jessicaport                 1  Rural                6
South Saramouth             7  Rural                4

[120 rows x 3 columns]

In [7]:
grouped_df['Total Fares'] = ride_data_df.groupby(['city']).sum()['fare']
grouped_df['Average Fare'] = ride_data_df.groupby(['city']).mean()['fare']
grouped_df

,driver_count,type,Number of rides,Total Fares,Average Fare
Richardfort,38,Urban,28,626.45,22.373214
Williamsstad,59,Urban,23,560.33,24.362174
Port Angela,67,Urban,19,452.90,23.836842
Rodneyfort,34,Urban,23,658.19,28.616957
West Robert,39,Urban,31,778.84,25.123871
...,...,...,...,...,...
Bradshawfurt,7,Rural,10,400.64,40.064000
New Ryantown,2,Rural,6,259.67,43.278333
Randallchester,9,Rural,5,148.71,29.742000
Jessicaport,1,Rural,6,216.08,36.013333
South Saramouth,7,Rural,4,144.64,36.160000

In [8]:
city_type_df = grouped_df.groupby(['type']).count()['Number of rides']
city_type_df

type
Rural       18
Suburban    36
Urban       66
Name: Number of rides, dtype: int64

In [9]:
city_type_df = pd.DataFrame(city_type_df)
city_type_df.index.name = None
city_type_df

          Number of rides
Rural                  18
Suburban               36
Urban                  66

In [10]:
city_type_df['Drivers'] = grouped_df.groupby(['type']).sum()['driver_count']
city_type_df['Average Fare'] = grouped_df.groupby(['type']).mean()['Average Fare']
city_type_df

          Number of rides  Drivers  Average Fare
Rural                  18       78     34.637765
Suburban               36      490     30.737298
Urban                  66     2405     24.499122

In [11]:
# Merging Data
pyber_data_df = pd.merge(ride_data_df, city_data_df, how='left', on=['city','city'])

pyber_data_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
...,...,...,...,...,...,...
2370,Michaelberg,2019-04-29 17:04:39,13.38,8550365057598,6,Rural
2371,Lake Latoyabury,2019-01-30 00:05:47,20.76,9018727594352,2,Rural
2372,North Jaime,2019-02-10 21:03:50,11.11,2781339863778,1,Rural
2373,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural
2374,Newtonview,2019-04-25 10:20:13,55.84,9990581345298,1,Rural